Repository: inrae/ALAMODE-okp
Catalog: sphinx-doc/tm/okplm-level2.tmx
Source language: en_gb
Languages: fr_fr

source: (21) in Prats & Danis (2019, p.6).
fr_fr: (21) dans Prats & Danis (2019, p.6).

source: (21, 23-25, 27-28) in Prats & Danis (2019, p.
fr_fr: (21, 23-25, 27-28) dans Prats & Danis (2019, p.

source: (23) in Prats & Danis (2019, p.
fr_fr: (23) dans Prats & Danis (2019, p.

source: (24) in Prats & Danis (2019, p.6).
fr_fr: (24) dans Prats & Danis (2019, p.6).

source: (25) in Prats & Danis (2019, p.
fr_fr: (25) dans Prats & Danis (2019, p.

source: (27) in Prats & Danis (2019, p.
fr_fr: (27) dans Prats & Danis (2019, p.

source: (28) in Prats & Danis (2019, p.
fr_fr: (28) dans Prats & Danis (2019, p.

source: A Python dictionary created from the key-value pairs in the text file.
fr_fr: Un dictionnaire Python créé depuis les paires clé-valeur dans le fichier texte.

source: A constant value of 0.51 by default.
fr_fr: Une valeur constante de 0.51 par défaut.

source: A dictionary of the OKP model parameter values according to Eq.
fr_fr: Un dictionnaire des valeurs des paramètres du modèle OKP d'après l'Éq.

source: A file located at "path" where the dictionary data is written.
fr_fr: Un fichier situé à "path" où le contenu du dictionnaire data est écrit.

source: A glossary of technical terms has been created to help with the translation and improve consistency.
fr_fr: Un glossaire de termes techniques a été créé pour aider dans la traduction et pour améliorer la consistance.

source: A glossary of technical terms has been created to improve the consistency of the translation.
fr_fr: Un glossaire de termes techniques a été créé pour améliorer la consistance de la traduction.

source: A text file named output_file is written.
fr_fr: Un fichier texte nommé output_file est écrit.

source: A tuple (m, a, ph) of the three coefficients of a sinusoidal function providing the mean value (m), the amplitude of the sinusoidal function (a), and the phase of the sinusoidal function (ph).
fr_fr: Un tuple (m, a, ph) des trois coefficients d'une fonction sinusoïdale donnant la valeur moyenne (m), l'amplitude de la fonction sinusoïdale (a), et la phase de la fonction sinusoïdale (ph).

source: A tuple of six performance indicators (n, sd, r, me, mae, rmse), corresponding to the number of measurements (n), the standard deviation (sd), the correlation coefficient (r), the mean error (me), the mean absolute error (mae), and the root mean square error (rmse).
fr_fr: Un tuple de six indicateurs de performance (n, sd, r, me, mae, rmse), correspondant au nombre de mesures (n), la déviation standard (sd), le coefficient de corrélation (r), l'erreur moyenne (me), l'erreur absolue moyenne (mae), et la racine carrée de l'erreur quadratique moyenne (rmse).

source: A tuple of two sequences/arrays (t_day, y_day).
fr_fr: Un tuple de deux séquences/arrays (t_day, y_day).

source: A tuple of two sequences/arrays (t_mon, y_mon).
fr_fr: Un tuple de deux séquences/arrays (t_mon, y_mon).

source: A tuple of two sequences/arrays (t_week, y_week).
fr_fr: Un tuple de deux séquences/arrays (t_week, y_week).

source: A: parameter *A*.
fr_fr: A : paramètre *A*.

source: ALPHA: parameter \ :math:`\alpha`\ , exponential smoothing factor of the air temperature.
fr_fr: ALPHA : paramètre \ :math:`\alpha`\ , facteur de lissage exponentiel de la température de l'air.

source: According to the GNU General Public License, a copyright notice is included in every module.
fr_fr: En accord avec la Licence Publique Générale GNU, une notice de copyright est incluse dans chaque module.

source: Air temperature has been created using a seasonal component and an ARMA model, while solar radiation data corresponds to the seasonal component only.
fr_fr: La température de l'air a été créée à l'aide d'une température avec une composante saisonnière et un modèle ARMA, tandis que les données de rayonnement solaire correspondent seulement à la composante saisonnière.

source: Alternatively, you can indicate the input data folder.
fr_fr: Alternativement, vous pouvez indiquer le dossier des données d'entrée.

source: An array of indices of dates in t comprised between t_start and t_end (or equal).
fr_fr: Un array des indices des dates dans t comprises entre t_start et t_end (ou égales).

source: An associated Python script (``test_script.py``) and a module based on the ``plotly`` package (``plotly_fonctions.py``) to plot results are available in the folder ``tests``.
fr_fr: un exemple de script Python (``tests/test_script.py``), et un module basée sur le paquet ``plotly`` (``tests/plotly_fonctions.py``) et permettant de visualiser les résultats.

source: And to install ``latexmk``, type:
fr_fr: Et pour installer ``latexmk``, tapez :

source: Apply a function using daily/subdaily values to obtain monthly values.
fr_fr: Applique une fonction à valeurs avec fréquence journalière/infra-journalière pour obtenir des valeurs mensuelles.

source: Apply a function using daily/subdaily values to obtain weekly values.
fr_fr: Applique une fonction à valeurs avec fréquence journalière/infra-journalière pour obtenir des valeurs hebdomadaires.

source: Apply a function using subdaily values as args to obtain daily values.
fr_fr: Applique une fonction à valeurs avec fréquence infra-journalière pour obtenir des valeurs journalières.

source: Authors
fr_fr: Auteurs

source: B: parameter *B*.
fr_fr: B : paramètre *B*.

source: BETA: parameter \ :math:`\beta`\ , exponential smoothing factor of the epilimnion temperature.
fr_fr: BETA : paramètre \ :math:`\beta`\ , facteur de lissage exponentiel de la température de l'épilimnion.

source: Be careful to maintain the reST formatting in the translated version.
fr_fr: Il faut veiller à maintenir le formatage reST dans la version traduite.

source: Before starting the translation it is advisable to check the source files thoroughly to eliminate any language or format issues.
fr_fr: Avant de commencer la traduction il est conseillé de relire attentivement les fichiers source pour éliminer des erreurs linguistiques ou de format.

source: Before starting the translation, the value of msgstr is empty:
fr_fr: Avant de démarrer la traduction, la valeur de msgstr est vide :

source: By default the program assumes the input data is provided at a daily time step.
fr_fr: Par défaut le logiciel présume que les données d'entrée sont données à un pas de temps journalier.

source: By default they take a value of 1.0.
fr_fr: Par défaut ils prennent une valeur de 1.0.

source: By default, the model looks for the files named ``meteo.txt`` (meteorological data), ``lake.txt`` (lake data) and ``par.txt`` (values of the model parameters).
fr_fr: Par défaut, le modèle cherche les fichiers nommés ``meteo.txt`` (données météorologiques), ``lake.txt`` (données du lac) et ``par.txt`` (valeurs des paramètres du modèle).

source: C: parameter *C*.
fr_fr: C : paramètre *C*.

source: Calculate epilimnion temperature.
fr_fr: Calcule la température de l'épilimnion.

source: Calculate error statistics.
fr_fr: Calcule statistiques d'erreur.

source: Calculate hypolimnion temperature.
fr_fr: Calcule la température de l'hypolimnion.

source: Calculate the water density as a function of temperature.
fr_fr: Calcule la densité de l'eau en fonction de la température.

source: Cloning the repository
fr_fr: Clonage du référentiel

source: Coding style guide
fr_fr: Guide de style de codage

source: Command line application
fr_fr: Application en ligne de commande

source: Compilation of the project documentation
fr_fr: Compilation de la documentation du projet

source: Compilation of the translated documentation
fr_fr: Compilation de la documentation traduite

source: Contents:
fr_fr: Contenu :

source: Creation of POT and PO files
fr_fr: Création de fichiers POT et PO

source: Creation of the project's documentation
fr_fr: Création de la documentation du projet

source: D: parameter *D*.
fr_fr: D : paramètre *D*.

source: Documentation in English
fr_fr: Documentation en anglais

source: Documentation in French
fr_fr: Documentation en français

source: E.g.
fr_fr: P. ex.

source: E.g.,
fr_fr: P. ex.,

source: E.g.:
fr_fr: P. ex.:

source: E: parameter *E*.
fr_fr: E : paramètre *E*.

source: Estimate the OKP parameter values.
fr_fr: Estime les valeurs des paramètres d'OKP.

source: Estimate the parameter A.
fr_fr: Estime le paramètre A.

source: Estimate the parameter B.
fr_fr: Estime le paramètre B.

source: Estimate the parameter C.
fr_fr: Estime le paramètre C.

source: Estimate the parameter E.
fr_fr: Estime le paramètre E.

source: Estimate the parameter alpha.
fr_fr: Estime le paramètre alpha.

source: Estimate the parameter beta.
fr_fr: Estime le paramètre beta.

source: Example
fr_fr: Exemple

source: Example of figure created by the function ``plotlyoutput()``
fr_fr: Exemple de figure créée avec la fonction ``plotlyoutput()``

source: Examples of usage of the package ``okplm``
fr_fr: Exemples d'utilisation du paquet ``okplm``

source: Field data used for validation may also be read from a text file (``validation_data_file``).
fr_fr: Les données de terrain utilisées pour la validation peuvent être lues depuis un fichier texte (``validation_data_file``).

source: File ``lake_file``
fr_fr: Fichier ``lake_file``

source: File ``meteo_file``
fr_fr: Fichier ``meteo_file``

source: File ``output_file``
fr_fr: Fichier ``output_file``

source: File ``par_file``
fr_fr: Fichier ``par_file``

source: File ``validation_data_file``
fr_fr: Fichier ``validation_data_file``

source: File ``validation_res_file``
fr_fr: Fichier ``validation_res_file``

source: Final report.
fr_fr: Rapport final.

source: Finally, if field data is available, the parameter values can be calibrated by the user using this package.
fr_fr: Enfin, si des données de terrain sont disponibles, les valeurs des paramètres peuvent être calées par l’utilisateur avec le paquet.

source: Fit a sinusoidal function to data.
fr_fr: Cale une fonction sinusoïdale aux données.

source: For daily simulations, the output can be given at daily, weekly of monthly frequencies with the arguments ``--daily_output``, ``--weekly_output`` and ``--monthly_output``.
fr_fr: Pour simulations journalières, la sortie peut être donnée à fréquence journalière, hebdomadaire ou mensuelle avec les arguments ``--daily_output``, ``--weekly_output`` et ``--monthly_output``.

source: For example, for French you need to do
fr_fr: Par exemple, pour la langue française vous devez faire

source: For example, for the Lake Allos (ALL04)::
fr_fr: Par exemple, pour le Lac d'Allos (ALL04)::

source: For example::
fr_fr: Par exemple::

source: For obtaining help on the usage of the application, write:
fr_fr: Pour avoir une aide sur l'utilisation de l'application, écrivez :

source: For the definition of the parameters and further information see Prats & Danis (2019).
fr_fr: Pour la définition des paramètres et plus d'information voyez Prats & Danis (2019).

source: For these three case the input is meteorological data (``meteo.txt``) and lake data (``lake.txt``).
fr_fr: Pour ces trois cas, les données météorologiques (``meteo.txt``) et les données lacustres (``lake.txt``) sont fournies en entrée au modèle.

source: For this go to an appropriate directory (e.g., ``pathtoprojectsfolder``) where to copy the project's code in a subfolder and clone the ``okplm`` project:
fr_fr: Pour ça, placez-vous dans un dossier approprié (e.g., ``pathtoprojrctsfolder``) où copier le code du projet et clonez le projet ``okplm`` :

source: For this, the package ``sphinx-intl`` is used.
fr_fr: Pour ça, le package ``sphinx-intl`` est utilisé.

source: Functions for the validation of simulation results.
fr_fr: Fonctions la validation des résultats des simulations.

source: Functions for time-related operations.
fr_fr: Fonctions pour opérations temporelles.

source: Functions to calculate parameter values.
fr_fr: Fonctions pour calculer les valeurs des paramètres.

source: Functions to read and write data.
fr_fr: Fonctions pour lire et écrire des données.

source: However, it can also recognise Markdown by installing the Markdown parser ``recommonmark``.
fr_fr: Mais il peut aussi reconnaître le formatage Markdown si on installe le parseur Markdown ``recommonmark``.

source: However, it is more efficient to use a PO editor (e.g., GNOME Translation Editor or PO edit) or computer assisted translation (CAT) software such as OmegaT.
fr_fr: Par contre, il est plus efficient d'utiliser un éditeur PO (p. ex., GNOME Translation Editor ou PO edit) ou des logiciels de traduction assistée par ordinateur (TAO) comme OmegaT.

source: If None, error statistics are not calculated.
fr_fr: Si c'est None, les statistiques d'erreur ne sont pas calculées.

source: If ``par_file`` is not given by the user, the model calculates the parameter values as a function of the lake characteristics defined in ``lake_file`` according to the parameterisation by Prats & Danis (2019) for French freshwater bodies.
fr_fr: Si ``par_file`` n'est pas donnée par l'utilisateur, le modèle calcule les valeurs des paramètres en fonction des caractéristiques du lac définies dans ``lake_file`` d'accord avec la paramétrisation de Prats & Danis (2019) pour les plans d'eau douce français.

source: If data is not available for all days for a given week, a nan value is returned.
fr_fr: S'il n'y a pas de données disponibles pour tous les jours d'une semaine, une valeur nan est retournée.

source: If data there are at least 3 days with missing data in a month, a nan value is returned.
fr_fr: S'il y a au moins 3 jours avec des données manquantes dans un mois, une valeur nan est retournée.

source: If no start and end date are defined, the length of the simulation is determined by the length of the ``meteo_file``.
fr_fr: Si la date de début et fin ne sont pas définies, la durée de la simulation est déterminée par la longueur de ``meteo_file``.

source: If the ``par_file`` is given, the program uses parameter values in ``par_file``.
fr_fr: Si ``par_file`` est donné, le programme utilise les valeurs des paramètres dans ``par_file``.

source: If the input data for a given day is less than 90% of the measurements for a day, a nan value is returned.
fr_fr: Si les données d'entrée disponibles pour un jour sont moins de 90% des mesures possibles pour un jour, une valeur nan est retournée.

source: If the par_file does not exist, it is also created by this function.
fr_fr: Si par_file n'existe pas, il est créé aussi par cette fonction.

source: If the project's documentation is updated, it is necessary to create new pot files following the procedure described above.
fr_fr: Si la documentation du projet est modifiée, il faut créer des nouveaux fichiers pot d'accord avec la procédure décrite ci-dessus.

source: If these file names are not provided, validation statistics are not calculated.
fr_fr: Si ces noms de fichier ne sont pas données, les statistiques de validation ne sont pas calculées.

source: If validation data is provided, the file validation_res_file containing information on error statistics is created too.
fr_fr: Si des données de validation sont fournies, le fichier validation_res_file contenant information sur les statistiques d'erreur est créé aussi.

source: If validation_data_file is defined, you need to define also validation_res_file.
fr_fr: Si validation_data_file est défini, il faut définir aussi validation_res_file.

source: If you do not have to compile the documentation, ``sphinx`` is not necessary to use ``okplm``, since a precompiled pdf copy of the documentation is included in the folder ``docs``.
fr_fr: Si vous ne devez pas compiler la documentation, ``sphinx`` n'est pas nécessaire pour utiliser ``okplm``, puisque une copie déjà compilée de la documentation en pdf est incluse dans le dossier ``docs``.

source: If you need to compile the documentation from source (e.g., to modify it), you will need the package ``sphinx``.
fr_fr: Si vous avez besoin de compiler la documentation depuis le code source (p. ex., parce que vous avez fait des modifications), vous aurez besoin du paquet ``sphinx``.

source: If you provide a file containing observational data (``validation_data_file``) and a file name where to write the validation results (``validation_res_file``), error statistics are calculated and written to the specified file.
fr_fr: Si vous fournissez un fichier contenant données observées (``validation_data_file``) et le nom d'un fichier où écrire les résultats de validation (``validation_res_file``), les statistiques d'erreur sont calculées et écrites dans le fichier spécifié.

source: In Windows, to use ``pip`` to install the required packages, please verify that the path to ``pip``'s executable file has been added correctly to your environment variable ``PATH``.
fr_fr: Dans Windows, pour utiliser ``pip`` pour installer les paquets requis, veuillez vérifier que le chemin à l'exécutable de ``pip`` a été ajouté à la variable d'environnement ``PATH``.

source: In all cases the lake data in the ``lake.txt`` file corresponds to the Lake Allos (lake code = ALL04).
fr_fr: Dans ces exemples, les données du lac dans le fichier ``lake.txt`` correspondent à celles du lac d'Allos. (code du lac = ALL04).

source: In the case of the simulation with daily data, the script ``test_script.py`` gives example of validation of the model results with an observation data file ``obs.txt``.
fr_fr: Dans le cas d'une simulation avec des données journalières, le script ``test_script.py`` donne un exemple de validation des résultats du modèle avec une fichier d'observation ``obs.txt``.

source: Indices and tables
fr_fr: Indices et tableaux

source: Input data
fr_fr: Données d'entrée

source: Installing ``okplm``
fr_fr: Installation de ``okplm``

source: It also facilitates the translation of docstrings and module documentation.
fr_fr: Cette méthode facilite aussi la traduction des docstrings et de la documentation des modules.

source: It contains air temperature and solar radiation data.
fr_fr: Il contient données de température de l'air et rayonnement solaire.

source: It contains lake characteristics (depth, surface, volume, altitude, latitude).
fr_fr: Il contient les caractéristiques du lac (profondeur, surface, volume, altitude, latitude).

source: It contains performance statistics of the simulation, calculated if ``validation_data_file`` and ``validation_res_file`` are defined.
fr_fr: Il contient statistiques de la simulation, calculées si ``validation_data_file`` et ``validation_res_file`` sont définis.

source: It contains the simulated epilimnion and hypolimnion temperature at the requested output periodicity.
fr_fr: Il contient la température simulée de l'épilimnion et de l'hypolimnion avec la périodicité de sortie sollicitée.

source: It contains the value of the model parameters.
fr_fr: Il contient la valeur des paramètres du modèle.

source: It corresponds to the mean annual epilimnion temperature (ºC).
fr_fr: Il correspond à la température moyenne annuelle de l'épilimnion (ºC).

source: It is also possible to obtain error statistics of the daily simulations by providing an observation data file (e.g., ``obs.txt``) and the name of the validation results file (e.g., ``err_stats.txt``):
fr_fr: Il est possible aussi d'obtenir statistiques d'erreur des simulations journalières si on fournit un fichier de données observées (p. ex., ``obs.txt``) et le nom du fichier des résultats de validation (p. ex., ``err_stats.txt``) :

source: It is equal to one when the water body is not stratified.
fr_fr: Il est égal à un quand le plan d'eau n'est pas stratifié.

source: It is located in the folder ``sphinx-doc/glossaries``.
fr_fr: Il est situé dans le dossier ``sphinx-doc/glossaries``.

source: It is only used if the periodicity of the simulations is 'daily'.
fr_fr: Utilisée seulement si la fréquence des simulations est 'daily'.

source: It is possible to find the values of certain parameters for other geographical settings such as Swedish lakes in the work by Ottosson & Abrahamsson (1998) or for the epilimnion temperature of southwest Greenland lakes in the work by Kettle *et al.* (2004).
fr_fr: Il est possible de trouver des valeurs des paramètres pour d'autres régions dans les travaux d'Ottosson & Abrahamsson (1998) (lacs suèdes) et Kettle *et al.* (2004) (température de l'épilimnion pour lacs du sud-ouest de Groenland).

source: It is possible to use the default parameter values obtained for French water bodies.
fr_fr: Il est possible d'utiliser les valeurs des paramètres par défaut obtenus pour les plans d'eau français.

source: It is related to the ratio between hypolimnion temperature and epilimnion temperature.
fr_fr: Il a relation avec le ratio entre la température de l'hypolimnion et la température de l'épilimnion.

source: It modulates the effect of air temperature.
fr_fr: Il module l'effet de la température de l'air.

source: It modulates the effect of solar radiation.
fr_fr: Il module l'effet du rayonnement solaire.

source: It requires the definition of a valid validation_data_file.
fr_fr: Il nécessite la définition d'un fichier validation_data_file valide.

source: Main output file.
fr_fr: Fichier de sortie principale.

source: Make sure it is installed before using ``okplm``.
fr_fr: Assurez-vous qu'il est installé avant l'utilisation de ``okplm``.

source: Meteorological data may be provided at three different frequencies: daily, weekly and monthly.
fr_fr: Il est possible de munir les données météorologiques avec trois fréquences différentes : journalière, hebdomadaire et mensuelle.

source: Missing timestamps are not allowed.
fr_fr: Les données manquantes ne sont pas permises.

source: OKP lake model constants.
fr_fr: Constantes du modèle de lacs OKP.

source: OKP lake model functions.
fr_fr: Fonctions du modèle de lacs OKP.

source: Obligatory input file.
fr_fr: Fichier d'entrée obligatoire.

source: Once you have created the input files, you can use the ``okplm`` package as a command line application or a Python module.
fr_fr: Une fois vous avez créé les fichiers d'entrée, vous pouvez utiliser le paquet ``okplm`` comme une application en ligne de commande ou un module Python.

source: Optional input file.
fr_fr: Fichier d'entrée optionnel.

source: Optional observational data file used for the calculation of performance indicators.
fr_fr: Fichier de données observées optionnel utilisé pour calculer indicateurs de performance.

source: Optional output file.
fr_fr: Fichier de sortie optionnel.

source: Other useful functions are ``okplm.read_dict()`` and ``okplm.write_dict()``, which can be used to read and write the lake data and parameter files.
fr_fr: D'autres fonctions utiles sont ``okplm.read_dict()`` et ``okplm.write_dict()``, qui peuvent être utilisées pour lire et écrire les fichiers de lac et des paramètres.

source: Otherwise, the ``lake_file`` is required and the program calculates the model parameters from the lake characteristics included in the ``lake_file``.
fr_fr: En cas contraire, il faut donner ``lake_file`` et le programme calcule les paramètres du modèle depuis les caractéristiques du lac spécifiées dans ``lake_file``.

source: Output data
fr_fr: Données de sortie

source: Parameter values can also be defined by the user.
fr_fr: Sinon, des valeurs des paramètres définies par l'utilisateur peuvent être utilisées.

source: Parameters
fr_fr: Paramètres

source: Parse command line arguments and run the OKP model.
fr_fr: Analyse les arguments en ligne de commande arguments et exécute le modèle OKP.

source: Please note that the software understands the tilde '~' expansion, so that you may use instead:
fr_fr: Veuillez noter que le logiciel comprends le remplacement du tilde '~', de façon que vous pouvez utiliser aussi :

source: Plotting of results
fr_fr: Visualisation des résultats

source: Preliminary steps
fr_fr: Pas préliminaires
